Tekla.Structures.DirectManipulation.Adapter.Interaction.HandleGraphicsExtensions
The static class Tekla.Structures.DirectManipulation.Adapter.Interaction.HandleGraphicsExtensions provides a set of extension methods for the Tekla.BIM.DirectManipulation.Services.Interaction.IHandleGraphic instance.

Tekla.Structures.DirectManipulation.Adapter.Interaction.HandleGraphicsExtensions.GetLineHandleGraphics(Tekla.BIM.DirectManipulation.Services.Interaction.IHandleGraphic,Tekla.Common.Geometry.Segment3)
Draws the given visualization data as a line handle.
visualizationData: The instance to draw as a line handle.
segment: The segment geometry.
Returns: The Tekla.BIM.DirectManipulation.Services.Graphics.Graphic drawn for the given data.

Tekla.Structures.DirectManipulation.Adapter.Interaction.HandleGraphicsExtensions.GetFaceHandleGraphics(Tekla.BIM.DirectManipulation.Services.Interaction.IHandleGraphic,Tekla.BIM.Geometry.Face3,System.Boolean)
Draws the given visualization data as a face handle.
visualizationData: The instance to draw as a face handle.
face: The face geometry.
edgesVisible: Indicates whether the edges should be visualized.
Returns: The Tekla.BIM.DirectManipulation.Services.Graphics.Graphic drawn for the given data.

Tekla.Structures.DirectManipulation.Adapter.Interaction.HandleGraphicsExtensions.GetRotationHandleGraphics(Tekla.BIM.DirectManipulation.Services.Interaction.IHandleGraphic,Tekla.Common.Geometry.Arc3)
Draws the given visualization data as a rotation handle.
Remarks:
When the handle is selected, the arrow on the start point of arc indicating positive rotation direction and
the one fourth of the circle with solid lines are drawn. Then for the remaining circle, every second
of the segment is drawn, therefore we only need to draw 1/4 + 1/8 + 1/8 + 1/8 = 5/8 of the full circle.
Therefor we need 1 / (5/8) = 1.6 * Tekla.Structures.DirectManipulation.Adapter.Graphics.NativeLinesGraphic.MaxSegmentsCount of segments.
visualizationData: The instance to draw as a rotation handle.
arc: The arc geometry.
Returns: The Tekla.BIM.DirectManipulation.Services.Graphics.Graphic drawn for the given data.

Tekla.Structures.DirectManipulation.Adapter.Interaction.HandleGraphicsExtensions.GetArcHandleGraphics(Tekla.BIM.DirectManipulation.Services.Interaction.IHandleGraphic,Tekla.Common.Geometry.Arc3)
Draws the given visualization data as an arc handle.
visualizationData: The instance to draw as an arc handle.
arc: The arc geometry.
Returns: The Tekla.BIM.DirectManipulation.Services.Graphics.Graphic drawn for the given data.

Tekla.Structures.DirectManipulation.Adapter.Interaction.HandleGraphicsExtensions.GetInteractiveTextGraphics(Tekla.BIM.DirectManipulation.Services.Interaction.IInteractiveText,Tekla.Common.Geometry.Segment3,System.Nullable{Tekla.BIM.DirectManipulation.Services.Interaction.InteractionState})
Draws the given visualization data as an interactive text.
visualizationData: The instance to draw as an interactive text.
location: The location.
state: The interaction state.
Returns: The Tekla.BIM.DirectManipulation.Services.Graphics.Graphic drawn for the given data.

Tekla.Structures.DirectManipulation.Adapter.Interaction.HandleGraphicsExtensions.GetPrimitiveGraphics(Tekla.BIM.DirectManipulation.Services.Interaction.IHandleGraphic,System.Object)
Gets the primitive graphic based on the visualization data and the geometry.
visualizationData: The visualization data.
geometryData: The geometry data.
Returns: The graphic based on the visualization data and the geometry.

Tekla.Structures.DirectManipulation.Adapter.Interaction.HandleGraphicsExtensions.IsDimension(Tekla.BIM.DirectManipulation.Services.Interaction.IHandleGraphic)
Determines whether the specified graphic is dimension.
graphic: The graphic.
Returns: true if the specified graphic is dimension; otherwise, false.